Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/zigbee/custome_cluster_client/firmware/src/packs/WBZ451_DFP/component/cfg.h
/* -------- CFG_CFGCON0CLR : (CFG Offset: 0x04) (R/W 32) Bit clear register -------- */
#define CFG_CFGCON0CLR_RESETVALUE             _UINT32_(0x00)                                       /*  (CFG_CFGCON0CLR) Bit clear register  Reset Value */

#define CFG_CFGCON0CLR_Msk                    _UINT32_(0x00000000)                                 /* (CFG_CFGCON0CLR) Register Mask  */


/* -------- CFG_CFGCON0SET : (CFG Offset: 0x08) (R/W 32) Bit set register -------- */
#define CFG_CFGCON0SET_RESETVALUE             _UINT32_(0x00)                                       /*  (CFG_CFGCON0SET) Bit set register  Reset Value */

#define CFG_CFGCON0SET_Msk                    _UINT32_(0x00000000)                                 /* (CFG_CFGCON0SET) Register Mask  */


/* -------- CFG_CFGCON0INV : (CFG Offset: 0x0C) (R/W 32) Bit invert register -------- */
#define CFG_CFGCON0INV_RESETVALUE             _UINT32_(0x00)                                       /*  (CFG_CFGCON0INV) Bit invert register  Reset Value */

#define CFG_CFGCON0INV_Msk                    _UINT32_(0x00000000)                                 /* (CFG_CFGCON0INV) Register Mask  */


/* -------- CFG_CFGCON1 : (CFG Offset: 0x10) (R/W 32)  -------- */
#define CFG_CFGCON1_RESETVALUE                _UINT32_(0x1F00443B)                                 /*  (CFG_CFGCON1)   Reset Value */

#define CFG_CFGCON1_DEBUG_Pos                 _UINT32_(0)                                          /* (CFG_CFGCON1) Background Debugger Access Selection Position */
#define CFG_CFGCON1_DEBUG_Msk                 (_UINT32_(0x3) << CFG_CFGCON1_DEBUG_Pos)             /* (CFG_CFGCON1) Background Debugger Access Selection Mask */
#define CFG_CFGCON1_DEBUG(value)              (CFG_CFGCON1_DEBUG_Msk & (_UINT32_(value) << CFG_CFGCON1_DEBUG_Pos)) /* Assigment of value for DEBUG in the CFG_CFGCON1 register */
#define CFG_CFGCON1_ICESEL_Pos                _UINT32_(3)                                          /* (CFG_CFGCON1) EMUC/EMUD Communication Channel Select Position */
#define CFG_CFGCON1_ICESEL_Msk                (_UINT32_(0x3) << CFG_CFGCON1_ICESEL_Pos)            /* (CFG_CFGCON1) EMUC/EMUD Communication Channel Select Mask */
#define CFG_CFGCON1_ICESEL(value)             (CFG_CFGCON1_ICESEL_Msk & (_UINT32_(value) << CFG_CFGCON1_ICESEL_Pos)) /* Assigment of value for ICESEL in the CFG_CFGCON1 register */
#define CFG_CFGCON1_TRCEN_Pos                 _UINT32_(5)                                          /* (CFG_CFGCON1) Trace Enable Position */
#define CFG_CFGCON1_TRCEN_Msk                 (_UINT32_(0x1) << CFG_CFGCON1_TRCEN_Pos)             /* (CFG_CFGCON1) Trace Enable Mask */
#define CFG_CFGCON1_TRCEN(value)              (CFG_CFGCON1_TRCEN_Msk & (_UINT32_(value) << CFG_CFGCON1_TRCEN_Pos)) /* Assigment of value for TRCEN in the CFG_CFGCON1 register */
#define CFG_CFGCON1_ZBTWKSYS_Pos              _UINT32_(7)                                          /* (CFG_CFGCON1) ZBT Subsystem External Wake-up source Position */
#define CFG_CFGCON1_ZBTWKSYS_Msk              (_UINT32_(0x1) << CFG_CFGCON1_ZBTWKSYS_Pos)          /* (CFG_CFGCON1) ZBT Subsystem External Wake-up source Mask */
#define CFG_CFGCON1_ZBTWKSYS(value)           (CFG_CFGCON1_ZBTWKSYS_Msk & (_UINT32_(value) << CFG_CFGCON1_ZBTWKSYS_Pos)) /* Assigment of value for ZBTWKSYS in the CFG_CFGCON1 register */
#define CFG_CFGCON1_CMP0_OE_Pos               _UINT32_(8)                                          /* (CFG_CFGCON1) Analog Comparator-0 Output Enable Position */
#define CFG_CFGCON1_CMP0_OE_Msk               (_UINT32_(0x1) << CFG_CFGCON1_CMP0_OE_Pos)           /* (CFG_CFGCON1) Analog Comparator-0 Output Enable Mask */
#define CFG_CFGCON1_CMP0_OE(value)            (CFG_CFGCON1_CMP0_OE_Msk & (_UINT32_(value) << CFG_CFGCON1_CMP0_OE_Pos)) /* Assigment of value for CMP0_OE in the CFG_CFGCON1 register */
#define CFG_CFGCON1_CMP1_OE_Pos               _UINT32_(9)                                          /* (CFG_CFGCON1) Analog Comparator-1 Output Enable Position */
#define CFG_CFGCON1_CMP1_OE_Msk               (_UINT32_(0x1) << CFG_CFGCON1_CMP1_OE_Pos)           /* (CFG_CFGCON1) Analog Comparator-1 Output Enable Mask */
#define CFG_CFGCON1_CMP1_OE(value)            (CFG_CFGCON1_CMP1_OE_Msk & (_UINT32_(value) << CFG_CFGCON1_CMP1_OE_Pos)) /* Assigment of value for CMP1_OE in the CFG_CFGCON1 register */
#define CFG_CFGCON1_CLASSBDIS_Pos             _UINT32_(10)                                         /* (CFG_CFGCON1) Disable CLASSB Device Functionality Position */
#define CFG_CFGCON1_CLASSBDIS_Msk             (_UINT32_(0x1) << CFG_CFGCON1_CLASSBDIS_Pos)         /* (CFG_CFGCON1) Disable CLASSB Device Functionality Mask */
#define CFG_CFGCON1_CLASSBDIS(value)          (CFG_CFGCON1_CLASSBDIS_Msk & (_UINT32_(value) << CFG_CFGCON1_CLASSBDIS_Pos)) /* Assigment of value for CLASSBDIS in the CFG_CFGCON1 register */
#define CFG_CFGCON1_SLRCTRL0_Pos              _UINT32_(11)                                         /* (CFG_CFGCON1) I2C Slew Rate Control for SERCOM0 Position */
#define CFG_CFGCON1_SLRCTRL0_Msk              (_UINT32_(0x1) << CFG_CFGCON1_SLRCTRL0_Pos)          /* (CFG_CFGCON1) I2C Slew Rate Control for SERCOM0 Mask */
#define CFG_CFGCON1_SLRCTRL0(value)           (CFG_CFGCON1_SLRCTRL0_Msk & (_UINT32_(value) << CFG_CFGCON1_SLRCTRL0_Pos)) /* Assigment of value for SLRCTRL0 in the CFG_CFGCON1 register */
#define CFG_CFGCON1_SLRCTRL1_Pos              _UINT32_(12)                                         /* (CFG_CFGCON1) I2C Slew Rate Control for SERCOM1 Position */
#define CFG_CFGCON1_SLRCTRL1_Msk              (_UINT32_(0x1) << CFG_CFGCON1_SLRCTRL1_Pos)          /* (CFG_CFGCON1) I2C Slew Rate Control for SERCOM1 Mask */
#define CFG_CFGCON1_SLRCTRL1(value)           (CFG_CFGCON1_SLRCTRL1_Msk & (_UINT32_(value) << CFG_CFGCON1_SLRCTRL1_Pos)) /* Assigment of value for SLRCTRL1 in the CFG_CFGCON1 register */
#define CFG_CFGCON1_SLRCTRL2_Pos              _UINT32_(13)                                         /* (CFG_CFGCON1) I2C Slew Rate Control for SERCOM2 Position */
#define CFG_CFGCON1_SLRCTRL2_Msk              (_UINT32_(0x1) << CFG_CFGCON1_SLRCTRL2_Pos)          /* (CFG_CFGCON1) I2C Slew Rate Control for SERCOM2 Mask */
#define CFG_CFGCON1_SLRCTRL2(value)           (CFG_CFGCON1_SLRCTRL2_Msk & (_UINT32_(value) << CFG_CFGCON1_SLRCTRL2_Pos)) /* Assigment of value for SLRCTRL2 in the CFG_CFGCON1 register */
#define CFG_CFGCON1_SMCLR_Pos                 _UINT32_(14)                                         /* (CFG_CFGCON1) Selects CRU handling of MCLR Control Position */
#define CFG_CFGCON1_SMCLR_Msk                 (_UINT32_(0x1) << CFG_CFGCON1_SMCLR_Pos)             /* (CFG_CFGCON1) Selects CRU handling of MCLR Control Mask */
#define CFG_CFGCON1_SMCLR(value)              (CFG_CFGCON1_SMCLR_Msk & (_UINT32_(value) << CFG_CFGCON1_SMCLR_Pos)) /* Assigment of value for SMCLR in the CFG_CFGCON1 register */
#define CFG_CFGCON1_QSCHE_EN_Pos              _UINT32_(15)                                         /* (CFG_CFGCON1) QSPI Address Space Cache Attribute Position */
#define CFG_CFGCON1_QSCHE_EN_Msk              (_UINT32_(0x1) << CFG_CFGCON1_QSCHE_EN_Pos)          /* (CFG_CFGCON1) QSPI Address Space Cache Attribute Mask */
#define CFG_CFGCON1_QSCHE_EN(value)           (CFG_CFGCON1_QSCHE_EN_Msk & (_UINT32_(value) << CFG_CFGCON1_QSCHE_EN_Pos)) /* Assigment of value for QSCHE_EN in the CFG_CFGCON1 register */
#define CFG_CFGCON1_QSPI_HSEN_Pos             _UINT32_(16)                                         /* (CFG_CFGCON1) QSPI (Direct) Enable Position */
#define CFG_CFGCON1_QSPI_HSEN_Msk             (_UINT32_(0x1) << CFG_CFGCON1_QSPI_HSEN_Pos)         /* (CFG_CFGCON1) QSPI (Direct) Enable Mask */
#define CFG_CFGCON1_QSPI_HSEN(value)          (CFG_CFGCON1_QSPI_HSEN_Msk & (_UINT32_(value) << CFG_CFGCON1_QSPI_HSEN_Pos)) /* Assigment of value for QSPI_HSEN in the CFG_CFGCON1 register */
#define CFG_CFGCON1_SCOM0_HSEN_Pos            _UINT32_(17)                                         /* (CFG_CFGCON1) SERCOM0 (Direct)High Speed Pin Enable Position */
#define CFG_CFGCON1_SCOM0_HSEN_Msk            (_UINT32_(0x1) << CFG_CFGCON1_SCOM0_HSEN_Pos)        /* (CFG_CFGCON1) SERCOM0 (Direct)High Speed Pin Enable Mask */
#define CFG_CFGCON1_SCOM0_HSEN(value)         (CFG_CFGCON1_SCOM0_HSEN_Msk & (_UINT32_(value) << CFG_CFGCON1_SCOM0_HSEN_Pos)) /* Assigment of value for SCOM0_HSEN in the CFG_CFGCON1 register */
#define CFG_CFGCON1_SCOM1_HSEN_Pos            _UINT32_(18)                                         /* (CFG_CFGCON1) SERCOM1 (Direct)High Speed Pin Enable Position */
#define CFG_CFGCON1_SCOM1_HSEN_Msk            (_UINT32_(0x1) << CFG_CFGCON1_SCOM1_HSEN_Pos)        /* (CFG_CFGCON1) SERCOM1 (Direct)High Speed Pin Enable Mask */
#define CFG_CFGCON1_SCOM1_HSEN(value)         (CFG_CFGCON1_SCOM1_HSEN_Msk & (_UINT32_(value) << CFG_CFGCON1_SCOM1_HSEN_Pos)) /* Assigment of value for SCOM1_HSEN in the CFG_CFGCON1 register */
#define CFG_CFGCON1_SCOM2_HSEN_Pos            _UINT32_(19)                                         /* (CFG_CFGCON1) SERCOM2 (Direct)High Speed Pin Enable Position */
#define CFG_CFGCON1_SCOM2_HSEN_Msk            (_UINT32_(0x1) << CFG_CFGCON1_SCOM2_HSEN_Pos)        /* (CFG_CFGCON1) SERCOM2 (Direct)High Speed Pin Enable Mask */
#define CFG_CFGCON1_SCOM2_HSEN(value)         (CFG_CFGCON1_SCOM2_HSEN_Msk & (_UINT32_(value) << CFG_CFGCON1_SCOM2_HSEN_Pos)) /* Assigment of value for SCOM2_HSEN in the CFG_CFGCON1 register */
#define CFG_CFGCON1_CCL_OE_Pos                _UINT32_(20)                                         /* (CFG_CFGCON1) CCL Pads (via PPS) Output Enable Position */
#define CFG_CFGCON1_CCL_OE_Msk                (_UINT32_(0x1) << CFG_CFGCON1_CCL_OE_Pos)            /* (CFG_CFGCON1) CCL Pads (via PPS) Output Enable Mask */
#define CFG_CFGCON1_CCL_OE(value)             (CFG_CFGCON1_CCL_OE_Msk & (_UINT32_(value) << CFG_CFGCON1_CCL_OE_Pos)) /* Assigment of value for CCL_OE in the CFG_CFGCON1 register */
#define CFG_CFGCON1_I2CDSEL0_Pos              _UINT32_(21)                                         /* (CFG_CFGCON1) I2C Delay Select for SERCOM0 Position */
#define CFG_CFGCON1_I2CDSEL0_Msk              (_UINT32_(0x1) << CFG_CFGCON1_I2CDSEL0_Pos)          /* (CFG_CFGCON1) I2C Delay Select for SERCOM0 Mask */
#define CFG_CFGCON1_I2CDSEL0(value)           (CFG_CFGCON1_I2CDSEL0_Msk & (_UINT32_(value) << CFG_CFGCON1_I2CDSEL0_Pos)) /* Assigment of value for I2CDSEL0 in the CFG_CFGCON1 register */
#define CFG_CFGCON1_I2CDSEL1_Pos              _UINT32_(22)                                         /* (CFG_CFGCON1) I2C Delay Select for SERCOM1 Position */
#define CFG_CFGCON1_I2CDSEL1_Msk              (_UINT32_(0x1) << CFG_CFGCON1_I2CDSEL1_Pos)          /* (CFG_CFGCON1) I2C Delay Select for SERCOM1 Mask */
#define CFG_CFGCON1_I2CDSEL1(value)           (CFG_CFGCON1_I2CDSEL1_Msk & (_UINT32_(value) << CFG_CFGCON1_I2CDSEL1_Pos)) /* Assigment of value for I2CDSEL1 in the CFG_CFGCON1 register */
#define CFG_CFGCON1_I2CDSEL2_Pos              _UINT32_(23)                                         /* (CFG_CFGCON1) I2C Delay Select for SERCOM2 Position */
#define CFG_CFGCON1_I2CDSEL2_Msk              (_UINT32_(0x1) << CFG_CFGCON1_I2CDSEL2_Pos)          /* (CFG_CFGCON1) I2C Delay Select for SERCOM2 Mask */
#define CFG_CFGCON1_I2CDSEL2(value)           (CFG_CFGCON1_I2CDSEL2_Msk & (_UINT32_(value) << CFG_CFGCON1_I2CDSEL2_Pos)) /* Assigment of value for I2CDSEL2 in the CFG_CFGCON1 register */
#define CFG_CFGCON1_WDTPSS_Pos                _UINT32_(24)                                         /* (CFG_CFGCON1) Watchdog Timer Post-scale Select Sleep Position */
#define CFG_CFGCON1_WDTPSS_Msk                (_UINT32_(0x1F) << CFG_CFGCON1_WDTPSS_Pos)           /* (CFG_CFGCON1) Watchdog Timer Post-scale Select Sleep Mask */
#define CFG_CFGCON1_WDTPSS(value)             (CFG_CFGCON1_WDTPSS_Msk & (_UINT32_(value) << CFG_CFGCON1_WDTPSS_Pos)) /* Assigment of value for WDTPSS in the CFG_CFGCON1 register */
#define CFG_CFGCON1_QSPIDDRM_Pos              _UINT32_(29)                                         /* (CFG_CFGCON1) QSPI DDR Mode Clock Enable Position */
#define CFG_CFGCON1_QSPIDDRM_Msk              (_UINT32_(0x1) << CFG_CFGCON1_QSPIDDRM_Pos)          /* (CFG_CFGCON1) QSPI DDR Mode Clock Enable Mask */
#define CFG_CFGCON1_QSPIDDRM(value)           (CFG_CFGCON1_QSPIDDRM_Msk & (_UINT32_(value) << CFG_CFGCON1_QSPIDDRM_Pos)) /* Assigment of value for QSPIDDRM in the CFG_CFGCON1 register */
#define CFG_CFGCON1_CLKZBREF_Pos              _UINT32_(30)                                         /* (CFG_CFGCON1) External Reference Clock ZB Enable Position */
#define CFG_CFGCON1_CLKZBREF_Msk              (_UINT32_(0x1) << CFG_CFGCON1_CLKZBREF_Pos)          /* (CFG_CFGCON1) External Reference Clock ZB Enable Mask */
#define CFG_CFGCON1_CLKZBREF(value)           (CFG_CFGCON1_CLKZBREF_Msk & (_UINT32_(value) << CFG_CFGCON1_CLKZBREF_Pos)) /* Assigment of value for CLKZBREF in the CFG_CFGCON1 register */
#define CFG_CFGCON1_Msk                       _UINT32_(0x7FFFFFBB)                                 /* (CFG_CFGCON1) Register Mask  */

#define CFG_CFGCON1_SLRCTRL_Pos               _UINT32_(11)                                         /* (CFG_CFGCON1 Position) I2C Slew Rate Control for SERCOMx */
#define CFG_CFGCON1_SLRCTRL_Msk               (_UINT32_(0x7) << CFG_CFGCON1_SLRCTRL_Pos)           /* (CFG_CFGCON1 Mask) SLRCTRL */
#define CFG_CFGCON1_SLRCTRL(value)            (CFG_CFGCON1_SLRCTRL_Msk & (_UINT32_(value) << CFG_CFGCON1_SLRCTRL_Pos)) 
#define CFG_CFGCON1_I2CDSEL_Pos               _UINT32_(21)                                         /* (CFG_CFGCON1 Position) I2C Delay Select for SERCOMx */
#define CFG_CFGCON1_I2CDSEL_Msk               (_UINT32_(0x7) << CFG_CFGCON1_I2CDSEL_Pos)           /* (CFG_CFGCON1 Mask) I2CDSEL */
#define CFG_CFGCON1_I2CDSEL(value)            (CFG_CFGCON1_I2CDSEL_Msk & (_UINT32_(value) << CFG_CFGCON1_I2CDSEL_Pos)) 

/* -------- CFG_CFGCON1CLR : (CFG Offset: 0x14) (R/W 32) Bit clear register -------- */
#define CFG_CFGCON1CLR_RESETVALUE             _UINT32_(0x00)                                       /*  (CFG_CFGCON1CLR) Bit clear register  Reset Value */

