Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/zigbee/custome_cluster_client/firmware/src/packs/WBZ451_DFP/component/cfg.h
#define CFG_CFGPGQOS_CPUPG_Pos                _UINT32_(0)                                          /* (CFG_CFGPGQOS) CPU (Code) Permission Group Position */
#define CFG_CFGPGQOS_CPUPG_Msk                (_UINT32_(0x3) << CFG_CFGPGQOS_CPUPG_Pos)            /* (CFG_CFGPGQOS) CPU (Code) Permission Group Mask */
#define CFG_CFGPGQOS_CPUPG(value)             (CFG_CFGPGQOS_CPUPG_Msk & (_UINT32_(value) << CFG_CFGPGQOS_CPUPG_Pos)) /* Assigment of value for CPUPG in the CFG_CFGPGQOS register */
#define CFG_CFGPGQOS_CPUQOS_Pos               _UINT32_(2)                                          /* (CFG_CFGPGQOS) CPU I/D and System Bus QOS Control Position */
#define CFG_CFGPGQOS_CPUQOS_Msk               (_UINT32_(0x3) << CFG_CFGPGQOS_CPUQOS_Pos)           /* (CFG_CFGPGQOS) CPU I/D and System Bus QOS Control Mask */
#define CFG_CFGPGQOS_CPUQOS(value)            (CFG_CFGPGQOS_CPUQOS_Msk & (_UINT32_(value) << CFG_CFGPGQOS_CPUQOS_Pos)) /* Assigment of value for CPUQOS in the CFG_CFGPGQOS register */
#define CFG_CFGPGQOS_ICDJPG_Pos               _UINT32_(4)                                          /* (CFG_CFGPGQOS) ICD-JTAG Permission Group Position */
#define CFG_CFGPGQOS_ICDJPG_Msk               (_UINT32_(0x3) << CFG_CFGPGQOS_ICDJPG_Pos)           /* (CFG_CFGPGQOS) ICD-JTAG Permission Group Mask */
#define CFG_CFGPGQOS_ICDJPG(value)            (CFG_CFGPGQOS_ICDJPG_Msk & (_UINT32_(value) << CFG_CFGPGQOS_ICDJPG_Pos)) /* Assigment of value for ICDJPG in the CFG_CFGPGQOS register */
#define CFG_CFGPGQOS_ICDJQOS_Pos              _UINT32_(6)                                          /* (CFG_CFGPGQOS) ICD-JTAG Bus QOS Control Position */
#define CFG_CFGPGQOS_ICDJQOS_Msk              (_UINT32_(0x3) << CFG_CFGPGQOS_ICDJQOS_Pos)          /* (CFG_CFGPGQOS) ICD-JTAG Bus QOS Control Mask */
#define CFG_CFGPGQOS_ICDJQOS(value)           (CFG_CFGPGQOS_ICDJQOS_Msk & (_UINT32_(value) << CFG_CFGPGQOS_ICDJQOS_Pos)) /* Assigment of value for ICDJQOS in the CFG_CFGPGQOS register */
#define CFG_CFGPGQOS_DMAPG_Pos                _UINT32_(8)                                          /* (CFG_CFGPGQOS) DMA (Rd/Wr) Permission Group Position */
#define CFG_CFGPGQOS_DMAPG_Msk                (_UINT32_(0x3) << CFG_CFGPGQOS_DMAPG_Pos)            /* (CFG_CFGPGQOS) DMA (Rd/Wr) Permission Group Mask */
#define CFG_CFGPGQOS_DMAPG(value)             (CFG_CFGPGQOS_DMAPG_Msk & (_UINT32_(value) << CFG_CFGPGQOS_DMAPG_Pos)) /* Assigment of value for DMAPG in the CFG_CFGPGQOS register */
#define CFG_CFGPGQOS_ADCPG_Pos                _UINT32_(16)                                         /* (CFG_CFGPGQOS) ADC Controller Permission Group Position */
#define CFG_CFGPGQOS_ADCPG_Msk                (_UINT32_(0x3) << CFG_CFGPGQOS_ADCPG_Pos)            /* (CFG_CFGPGQOS) ADC Controller Permission Group Mask */
#define CFG_CFGPGQOS_ADCPG(value)             (CFG_CFGPGQOS_ADCPG_Msk & (_UINT32_(value) << CFG_CFGPGQOS_ADCPG_Pos)) /* Assigment of value for ADCPG in the CFG_CFGPGQOS register */
#define CFG_CFGPGQOS_ADCQOS_Pos               _UINT32_(18)                                         /* (CFG_CFGPGQOS) ADC Controller QOS Control Position */
#define CFG_CFGPGQOS_ADCQOS_Msk               (_UINT32_(0x3) << CFG_CFGPGQOS_ADCQOS_Pos)           /* (CFG_CFGPGQOS) ADC Controller QOS Control Mask */
#define CFG_CFGPGQOS_ADCQOS(value)            (CFG_CFGPGQOS_ADCQOS_Msk & (_UINT32_(value) << CFG_CFGPGQOS_ADCQOS_Pos)) /* Assigment of value for ADCQOS in the CFG_CFGPGQOS register */
#define CFG_CFGPGQOS_ICMPG_Pos                _UINT32_(20)                                         /* (CFG_CFGPGQOS) ICM Permission Group Position */
#define CFG_CFGPGQOS_ICMPG_Msk                (_UINT32_(0x3) << CFG_CFGPGQOS_ICMPG_Pos)            /* (CFG_CFGPGQOS) ICM Permission Group Mask */
#define CFG_CFGPGQOS_ICMPG(value)             (CFG_CFGPGQOS_ICMPG_Msk & (_UINT32_(value) << CFG_CFGPGQOS_ICMPG_Pos)) /* Assigment of value for ICMPG in the CFG_CFGPGQOS register */
#define CFG_CFGPGQOS_ICMQOS_Pos               _UINT32_(22)                                         /* (CFG_CFGPGQOS) ICM QOS Control Position */
#define CFG_CFGPGQOS_ICMQOS_Msk               (_UINT32_(0x3) << CFG_CFGPGQOS_ICMQOS_Pos)           /* (CFG_CFGPGQOS) ICM QOS Control Mask */
#define CFG_CFGPGQOS_ICMQOS(value)            (CFG_CFGPGQOS_ICMQOS_Msk & (_UINT32_(value) << CFG_CFGPGQOS_ICMQOS_Pos)) /* Assigment of value for ICMQOS in the CFG_CFGPGQOS register */
#define CFG_CFGPGQOS_DSUPG_Pos                _UINT32_(24)                                         /* (CFG_CFGPGQOS) DSU Permission Group Position */
#define CFG_CFGPGQOS_DSUPG_Msk                (_UINT32_(0x3) << CFG_CFGPGQOS_DSUPG_Pos)            /* (CFG_CFGPGQOS) DSU Permission Group Mask */
#define CFG_CFGPGQOS_DSUPG(value)             (CFG_CFGPGQOS_DSUPG_Msk & (_UINT32_(value) << CFG_CFGPGQOS_DSUPG_Pos)) /* Assigment of value for DSUPG in the CFG_CFGPGQOS register */
#define CFG_CFGPGQOS_FCQOS_Pos                _UINT32_(28)                                         /* (CFG_CFGPGQOS) FC Controller QOS Control Position */
#define CFG_CFGPGQOS_FCQOS_Msk                (_UINT32_(0x3) << CFG_CFGPGQOS_FCQOS_Pos)            /* (CFG_CFGPGQOS) FC Controller QOS Control Mask */
#define CFG_CFGPGQOS_FCQOS(value)             (CFG_CFGPGQOS_FCQOS_Msk & (_UINT32_(value) << CFG_CFGPGQOS_FCQOS_Pos)) /* Assigment of value for FCQOS in the CFG_CFGPGQOS register */
#define CFG_CFGPGQOS_WISIBQOS_Pos             _UINT32_(30)                                         /* (CFG_CFGPGQOS) Wireless SIB QOS Control Position */
#define CFG_CFGPGQOS_WISIBQOS_Msk             (_UINT32_(0x3) << CFG_CFGPGQOS_WISIBQOS_Pos)         /* (CFG_CFGPGQOS) Wireless SIB QOS Control Mask */
#define CFG_CFGPGQOS_WISIBQOS(value)          (CFG_CFGPGQOS_WISIBQOS_Msk & (_UINT32_(value) << CFG_CFGPGQOS_WISIBQOS_Pos)) /* Assigment of value for WISIBQOS in the CFG_CFGPGQOS register */
#define CFG_CFGPGQOS_Msk                      _UINT32_(0xF3FF03FF)                                 /* (CFG_CFGPGQOS) Register Mask  */


/* -------- CFG_CFGPGQOSCLR : (CFG Offset: 0x54) (R/W 32) Bit clear register -------- */
#define CFG_CFGPGQOSCLR_RESETVALUE            _UINT32_(0x00)                                       /*  (CFG_CFGPGQOSCLR) Bit clear register  Reset Value */

#define CFG_CFGPGQOSCLR_Msk                   _UINT32_(0x00000000)                                 /* (CFG_CFGPGQOSCLR) Register Mask  */


/* -------- CFG_CFGPGQOSSET : (CFG Offset: 0x58) (R/W 32) Bit set register -------- */
#define CFG_CFGPGQOSSET_RESETVALUE            _UINT32_(0x00)                                       /*  (CFG_CFGPGQOSSET) Bit set register  Reset Value */

